{"text": "I was being interviewed for SE 2 where 1 round had DS plus design and other 2 rounds were purely design.\nAfter that HM round was purely into specific technologies (Which I feel that it should be on concept instead of expecting from candidate that they might have used it)\nSo HM round seemed to be not that convincing but I got offer.\nEducation: BTech IT\nYears of Experience: 8+\nPrior Experience: 5+ years with Adobe, 2+ years with Verizon Hyd\nDate of the Offer: 23/03/2021\nCompany: Microsoft\nTitle/Level: SE 2/L61\nLocation: Hyderabad\nSalary: 27 LPA\nRelocation: 1 Month Salary\nSigning Bonus: 5 Lacs (3+2)\nStock bonus: 75000 USD\nBonus: (0-20%) Around 5 lacs\nTotal comp (Salary + Bonus + Stock): 50,52,000 LPA\nBenefits: Didn't want to listen after this offer\nOther detail\nQuestions in Hyderabad:\nFirst Round:\nFind two numbers in array with given target sum\nSecond Round:\nDesign Google Drive\nThird Round:\nDesign Elevator\nQuestions asked in Noida Drive\nFirst Round:\nWord break II\nFind number in row column sorted matrix\nSecond Round:\nMax substring length with K distinct character\nDesign text justification in MS word.\nThird Round\nDesign infinite tic tac toe\nDesign auto-complete feature\nConsidering my experience and college, on't know how they can ignore all these things, and above of all when I said that it is very low considering my experience so he said that experience is not the only thing.\nI said I need time I am waiting MS noida and PayPal offer but 61 is very low.\nOn this he tried pressurizing me by getting angry that how can you apply for 2 locations, offer for other one will be freezer and you will only have one offer. I said how can I decide on Noida's one if I don't even get to see the numbers in case it gets freezed.\nOn this he said that numbers will be same, I was like what he is saying. Level of interview was different, panel was different, team is different so how come the numbers will be same.\nThis is the way they treat candidates just to ensure that they get hired in such a low package and struggle inside to grow.\nPlease suggest what should I do, can it be possible that he might manipulate other offer (I had already discussed this with Noida's HR that I have just completed Hyderabad's event so can I again give the interviews on which she said yes"}