{"text": "Education: BTech in CSE\nYears of Experience: 1 year 11 months\nCompany : Adobe\nTitle/Level : Member of Techincal Staff 2\nLocation : Noida, India\nSalary : INR 21,60,000 Base (Including PF & Gratuity)\nSigning Bonus : INR 5,00,000\nDeferred Bonus : INR 5,00,000\nStock bonus : 55K USD over 4 years (~INR 10L per year)\nPerformance Bonus : INR 2,00,000\nTotal comp (Salary + Performance Bonus + Joining Bonus + Stock) : INR 38,60,000 first year\nBenefits : Standard Adobe benefits\nCompany : Cohesity\nTitle/Level: MTS - 3\nLocation: Bangalore\nSalary: INR 27,00,000 + PF (INR 1,62,000)\nStock bonus: 3420 RSUs over 4 years ($40 a piece quoted by HR) (~INR 25,00,000)\nPerformance Bonus: INR 1,35,000\nTotal comp (Salary + Bonus + Stock): INR 55,00,000\nBenefits: Free Meals, Gym vouchers, Health Insurance, Gratuity, Transport, Health Checkup Reimbursements\nPrevious TC: INR 21,30,000 (base) + INR 2,00,000 (performance bonus)\nUpdates:\nI decided to go with Adobe. I decided this because of the following reasons:\nProject -- I asked both of them to setup a call with the to-be-managers so that I could have a discussion on the kind of work I'd do and the project I'd be working on. Adobe did that twice. Cohesity's HR asked me to first accept the offer. Only then they would schedule the call. I rejected their offer and the call was setup the very day.\nCompensation -- Cohesity's stock value was ambiguous. Since I'm the sole earning member of the family, I wanted surity in the Covid times.\nWork Life Balance -- People usually tend to burn out the initial few years in startups where there is huge learning potential, and then switch to settled companies in the later years when the pressure of raising a family comes up. However,I live at home and I didn't want to spend all the time working without having the leisure to enjoy snack and chat times with my family (this is my personal POV. I'm sure many would disagree, and I respect their opinion as well).\nEdit:\nInterview experience with Microsoft here.\nInterview experiences with other companies coming up soon."}