{"text": "Hey everybody,\nAfter getting lot of courage, I am sharing some wise advise to all. Hopefully it help all ppl.\nAmazon a big brand but its always good to know the reality after all.\nIf you are going after brand name Amazon then think 100 times (after reading this) before you join here. otherwise it will be lethal for your career and you both.\nSituation in Amazon India is really worst and same can be checked on google about it.\nThis place keep giving you scars for life forever even though some people work without will. I will explain on basis of reality.\nForget your life, health and everything else if you want to be successful here. It will be lucky day if you get\n6-7 hours sleep. Your will be working atleast > 15 hours a day most of times. You life will be messed and you become mentally ill with time.\nIf you're someone who likes your 7 hours of sleep a day, stay away.\nAlso don't afraid if you find your co-workers (really many) drawer filled with many pills (medicines). Imagine what those pills could be of.\nEver thought, Why amazon gives first year only 5% stock vesting? As amazon knows very well most of the employees will\nleave in the very first year. Because it knows 60-70 % will be forcefully fired or made to leave (more info explained below) in 1 year or\ninfact few months.\nEver though the reason why other companies gives 20% stocks in 1 st year while amazn only 5%.\nIt frequently hires with an intent to fire (URA / Pivot). Unregretted attrition amazon (URA, you can also google if you dont believe).\nFor every org / team there is URA % i.e. these many % of employees must be forcefully fired every year. Youknow their carrer is dumped\nand these got mentally tortured before reaching to that stage.\nThis % is mostly around 30 %, but it depends org to org.\nThis might seem odd, however it’s the reality.\nThis is how employees are forced to leave and thrown under the bus. And their carrer is spoiled.\nManagers are given targets to fire around 30% people every year. Actually here employee is made to leave.\nI.e. Employee is given 2 options Either take severance money (rightly heard, money to leave from here) or take\n1 month plan where some un-achievable tasks are provided to developer which even 2 ppl can't do in 2 months.\nSee its employee choice to get _ or accept and resign.\nThis is forced termination of employee.\nThe politics is so high that they will ask old timers, to write secret emails against the newly hired employee.\nThe existing employees are happy to write fake feedback emails to save their own jobs.\nSee at the time of review, even if the new person is the best performer. he will be fired.\nManager would have achieved firing quota, without touching any old timers.\nManagers fear old employees as well, since the old timers know how the system works,\nso it is safer to hire someone from outside and quietly fire them.\nSo,the firing has nothing to do with performance. It’s political.\nThe HR looks the other way, even though they are completely aware of the sinister and non-human game going on. Managers are trained to play this slaughter and non-human game.\nNo wonder why the attrition rates are sky high.\nMany managers cleverly hire people from outside, give them impossible tasks, quietly create bottlenecks\nso that the newly hired person fails at his job, and can be fired. You can also become victim of it as many already became.\nThis is how URA quota filled. Many of such ppl who cleared and got offer, don't even know what the hell is\nwaiting for them.\nThey can put you in dev plan for any reason, any you will be forced to either leave or struggle and prove your self.\nThey keep puting you many times there because person can not switch team if he is in dev plan and\nthey use this to make them their slaves and later put them pip and mentally torture and throw under the bus.\nAnd their career is spoiled forever.\nThese pics speak reality, how people career is played and spoiled.\nHire-to-Fire. This is applicable in all orgs there. Internet also resonates with it.\n\nEver though why so many x - employees of amazon having long employement gap in their linkedin profile.\nThis is the reason, their career is dumped.\nIf you're someone who has a family that you'd like to spend more than a few seconds of a day with, stay away.\nIf you're really smart then stay away - you can easily land a job at a much better work place. The work here isn't technically challenging\nat all; it is challenging in the sense that you're woken up in the middle of the night and have to fix things however you can,\nhowever quickly you can, so that you can be in to work the next day.\nA note to people who are about to join amazon, or those who recently joined:\nIf you can turn down your offer and can continue interviewing elsewhere, I will suggest doing that. Staying here is like damaging yourself and jumping to poison pool.\nIf you've got no other option, or if you've recently joined, give it a 3-4 months; don't assume things will improve - they never do.\nThis place scars you for life. People suffering the after-effects.\nKeep coding on the side to keep up your design skills. I personally know so many people who were scared to interview at other places, since they felt they'd lost all skills.\nIf you feel the same way, don't worry - some open source coding is good enough to bring you up to scratch.\nDon't let their ridiculous stock vesting cycle trap you! You'll lose most of your stocks whenever you leave.\nIf you realize you're starting to have more headaches and aches at that part (you know), or your blood pressure is beginning to get higher, or if you face any health issues whatsoever,\njust put in your papers. Those are the first symptoms that things are beginning to go downhill. This way you will be dumped with your career. Better to correct before too late.\nI can provide more reality, but long story short -\nSTAY AWAY! You do NOT want to ever work here (Amazon India). Most likely other countries office have also the same problem(searched on internet).\nIts your choice if you want to spend some time here and then burned and career dumped after some time.\nIts always better to learn from others experience. If you still want to know more search google you will find\nlot more and real sh*t about this and also you can search \"teamblind . com\" on google where people have brought the real truth.\nMight be then you could take some better decision before spoiling your precious health and career."}