{"text": "Updates : Clarified a few things\nUpdates 2 : Uh, end up making a really long post... I can try my best to answer some questions. I consider myself really lucky, born in this era, where a not so smart person like me was fortunate enough to work in some well known companis and well paid jobs. I wish I can help as many as I can.\nDegree :- Masters in CS\nPrior Experience: SDE2 AWS\nYears of Exp. : >6 years (backend)\nPrior Years of Exp. : 2 years (as iOS engineer, not mentioned to recruiter)\nLevel - E5\nBase - $203,000\nBonus - 15% (Meets All)\nStock - $637000 (4 yrs 25/25/25/25)\nSign-on - $95000\nRelocation Package : None\nCompeting Offers - DoorDash E5\nTotal Compensation for the first Year: $487,700\nUpdates for some interview experiences and prep:\nInterview is consists of 2 coding rounds (finish 1 medium + 1 hard or 2 hard problems in 40 minutes, coding + explanation) 1 system design and 1 BQ round.\nPhone screen is around the same, finish 2 medium problems within 35-40 minutes.\nPersonally did ~600 leetcode problems, 2 months prep of system design (reading some papers, watch videos, read Design Data Intensive Application, did 2 mocks), and using interviews to practice.\nSystem Design Prep Summary\nLong term: For long term prep of System Design (>= 2 months)\nRecommend DDIA reading; If you don't have enough time, at least read general chapters of distributed systems and chapters about Sharding, Partitioning;\nThere are a few good papers, very beneficial to read: Amazon Dynamo, Google Spanner, Facebook TAO, Akamai Network), if you have access to Amazon POA, watch some ALV's videos\nRead some engineering blogs, more targeted to the companies you are interested in. E.G. Facebook blog discussed about how HBase was initially selected (over Cassandra or SQL) for comments, how viwership is maitained; Similiarly, Twitter has blogs discuss about how reverse index is built for search experience (2-dimensional sharding) and aggregated (Aggregation pipeline)\nRead more (breadth of knowledge) about different use cases for similar technologies (e.g. How rabbitMQ, Kafka, AWS SQS, Kinesis are going to be used in different scenarios etc.)\nIntermediate Term: ~1 month\nIntensively watch some videos (Youtube has System Design Interview channel, I think by a principle engineer in Amazon, another good one is by Tushar Roy)\nRead as much as case studies as you can and try to memorize things. At least get familiar with different components\nShort Term: might have 2 weeks before your onsite\nAlex Xu has a book called System Design Interview, read as much as you can.\nTry to find some problems from the company you are interviewing with (Yelp / Uber might have some geological problems right? Get familiarized with quad-tree; Stripe / Instacart / Square involves payment, at least read something about achieving idempotency; Coinbase might needs to compute block chain network? Maybe at least in principle knows how Paxos/Raft works)\nThis repo: https://github.com/donnemartin/system-design-primer\nBQ Prep Summary\nDepending on your position, think about what kind of people you want to work with:\nA junior engineer needs to independently working on components, fast, provide concrete solution, care about customer;\nA senior engineer is expected to be a techlead, working through others, mentorship, shielding your team, help roadmap planning;\nA even more senior engineer, is expected to plan for the general org level architecutre and tech roadmap, also needs to \"manage up\", independenly discover tech stack bottlenecks and plan ahead, even more coaching, mentorship, guidance, larger influence across orgs;\nRegardless of what position you are in, no one wants to work with a smartass or a jerk, think about how you are not just a coding monkey, but also treat others are human, impersonable.\nWork on these points, with your experience and stories so your interviewer can take good notes about you.\nGood luck, have fun."}