{"text": "I've highlighted what I believe my post includes that most others do not. Ask me your questions in the comments and I'll do my best to asnwer them! :)\nEducation: BS of Computer Science from the University of Massachusetts Lowell (it's an okay->good program)\nYears of Experience: 0\nPrior Experience: 1 year of internship/co-op experience (Draper Labs & Putnam Investments)\nDate of the Offer: December 6, 2019\nCompany: Amazon\nTitle/Level: SDE1\nLocation: Seattle/Bellevue, WA (In the process of negotiating via recruiter)\nSalary: $112,000\nRelocation: $6,800\nSigning Bonus: $26,000 for first year of employment followed by $22,000 for second year of employment.\nStock bonus: $80,000 in stock vested over 4 years (5%, 15%, 40%, 40%)\nBonus: No yearly bonus\nVacation Days: 10days for first years (15days for 2nd-5th years)\nTotal comp (Salary + Bonus + Stock): 1st year ($148,800), 2nd year (146,000), 3rd/4th years (144,000)\n-Compensation can be changed/updated after first year of employment.\nOther details: Bonuses are earned at the end of the year, If you do not stay for that year, you haven't \"earned\" the bonus and will have to return it in full.\n401k: Match 50% of your contribution up to 4%. So, they match 2% of salary and it takes 3years to vest.\nNegotiating Location\nMy approach was to get talk to my recruiter over the phone, express my interest in changing my location and if it was a hard NO, to try and negotiate vacation days and other benefits that can be considered a consolation prize. I do have another other from a company in Boston that, if need be, I would use as a negotiation piece. My plan remains the same, however, they rejected my phone call idea and told me to do it over email, which is fine, it will just take longer and I'm more convincing talking over the phone than email.\nI'll update when I can.\nUpdate\nFirst, Amazon is terrible when it comes to responding to emails - some emails I sent never received a response, some emails received multiple responses from different recruiters. The reason for this could have been been it's around the holidays and there could be a lot of work, things may become unorganized, etc.\nYou have 3 weeks to accept or decline an offer. This is my timeline:\nBeginning of 1st week - Reached out asking for a phone call to discuss my questions.\nMiddle of 1st week - I was denied a phone call and told to email my questions.\nMiddle of 1st week - Sent an email asking for a location change with the excuse of \"familial reasons that require attention.\" I waited a week (the recommended time) and never recieved a response.\nMiddle of 2nd week - I sent the same email again and got a response a few days later that was a generic no but they also asked for more reasons as to why I would like a change.\nMiddle of 2nd week - I sent an email stating a family reason as to why I prefer a change of locaiton. Never received a response email.\nBeginning of 3rd week - Recieved a response email to my intial email I sent 3 week prior asking me what questions I had. I responded explaining I had just sent an email to a recrutier named ______, about relocation.\nEnd of 3rd week - Last day to accept offer so, I did.\nEnd of 3rd week - I received a email stating they had put a request to change locations.\nFINAL UPDATE - I have been granted an exception and my location has been changed\nAfter thoughts\nIf you want to negotiate location, state it immediately and give the reason why. A normal back and forth conversion via emial won't happen. A vague reason as to why you would rather relocate the offer location won't get you a change. If you have a good reason to change location, say it, otherwise you may have to abandon some principles. The trick with excuses is to give enough detail to get the point across but not so little where they don't see your reasoning. There's a small range that may work and they are as follows:\nI have a sick family member.\nNOTE: Don't be over the top with this. You don't want to create a narrative that makes them think it will consume all of your time as well as, you won't accept the offer if the location doesn't change. A good excuse that's simple, vague, does the job, and you can back up if they ask for more, which I doubt they would.\nMy fiance or fiancee are in location ______ where I would like too be\nIt's not ethical but if you want a location change and don't have a good excuse on your own, you'll have to make one up.\nAlso, I won't be sharing the excuse that I gave.\nMy experience -> https://leetcode.com/discuss/interview-experience/450012/Amazon-or-SDEI-or-2020-New-Grad-(B.S.)-or-Seattle-or-Dec.-2019-Offer"}