{"text": "Education: PhD in ECE from a top 5 US school\nYears of Experience: 1.5 years\nPrior Experience: ML Scientist in a Tier-2 company\nDate of the Offer: June 2, 2020\nCompany: Amazon\nTitle/Level: Senior Applied Scientist/L6\nLocation: Seattle\nSalary: $160000\nSigning Bonus: Year 1: $219000, Year 2: $157000\nRelocation: Either completely taken care of by Amazon or $13000 lumpsum\nStock bonus: $424000 with vesting as 5/15/40/40 across 4 years\nTotal comp (Salary + Bonus): $400000 First year\nBenefits: Standard Amazon compensation\nOther details: Negotiated the offer with a few hours to go before the deadline and the recruiter was nice enough to send me the updated offer soon.\nInterview Details:\nPhone Screen Round 1: One simple coding question on finding the kth largest element in an array. DL breadth covering when to use wide vs deep networks; whether GD/SGD always decreases loss; one LP question\nPhone Screen Round 2: ML Depth, mostly focusing on my PhD research and publications. We discussed a particular paper of mine in great depth. It was more of an open ended discussion than the interviewer asking me questions.\nVirtual Onsite (Bound by NDA):\nRound 1: One hour research talk; got asked a couple of questions may be throughout\nRound 2: Bar Raiser: LPs and ML Applied problem solving pertaining to Recommendation Systems and Error constrained classification\nRound 3: ML Breadth, Mostly related to properties of loss functions; optimization in general; robustness of DL algorithms; 2 LP questions\nRound 4: 30 mins of 3 LPs, A coding question on strings. Due to video conferencing issues, I couldn't go through the test cases. I could only finish writing the code which was largely correct after discussing my approach.\nRound 5: Hiring Manager round. 25 mins of LPs followed by a deep dive of one of my previous internship projects.\nRound 6: ML Depth, Was very much like my phone screen round 2. The interviewer particularly discussed one of my recent papers in great depth. Questions ranged from from clarification questions to what ifs?"}